In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# IMPORT DATA

In [182]:
noaa = pd.read_csv("./Data/noaa_hellinikon_1995_2020.csv")
athens_ds_names = ["DATE","mean_Temp (°C)","max_Temp (°C)","min_Temp (°C)","mean_Rel_Humidity(%)",
                   "max_Humidity(%)","min_Humidity(%)",
                  "mean_Atm_Pressure(hPa)","max_Atm_Pressure(hPa)","min_Atm_Pressure(hPa)",
                   "Rainfall (mm)","Wind_Speed (km/h)","Wind_Direction",
                   "Wind_Gust (km/h)"]

athens = pd.read_csv("./Data/athens.csv",names=athens_ds_names)

# PREPARE THE DATA

In [194]:
print(athens.dtypes)
print("="*30)
print(noaa.dtypes)

noaa

DATE                       object
mean_Temp (°C)            float64
max_Temp (°C)              object
min_Temp (°C)              object
mean_Rel_Humidity(%)      float64
max_Humidity(%)             int64
min_Humidity(%)             int64
mean_Atm_Pressure(hPa)    float64
max_Atm_Pressure(hPa)     float64
min_Atm_Pressure(hPa)     float64
Rainfall (mm)             float64
Wind_Speed (km/h)         float64
Wind_Direction             object
Wind_Gust (km/h)          float64
dtype: object
==============================
STATION            object
NAME               object
DATE               object
mean_Temp (°C)    float64
dtype: object

           STATION            NAME        DATE  mean_Temp (°C)
0      GR000016716  HELLINIKON, GR  1955-01-01             NaN
1      GR000016716  HELLINIKON, GR  1955-01-02             NaN
2      GR000016716  HELLINIKON, GR  1955-01-03             NaN
3      GR000016716  HELLINIKON, GR  1955-01-04             NaN
4      GR000016716  HELLINIKON, GR  1955-01-05             NaN
...            ...             ...         ...             ...
23246  GR000016716  HELLINIKON, GR  2020-12-27            16.6
23247  GR000016716  HELLINIKON, GR  2020-12-28            14.8
23248  GR000016716  HELLINIKON, GR  2020-12-29            16.3
23249  GR000016716  HELLINIKON, GR  2020-12-30            16.4
23250  GR000016716  HELLINIKON, GR  2020-12-31            15.4

[23251 rows x 4 columns]

In [184]:
athens["mean_Temp (°C)"] = pd.to_numeric(athens["mean_Temp (°C)"],errors="coerce") #Convert to float64
noaa.rename(columns={"TAVG":"mean_Temp (°C)"},inplace=True) #Change the name of the columnt to match with the other df

athens_tmp = athens[["DATE","mean_Temp (°C)"]]
noaa_tmp = noaa[["DATE","mean_Temp (°C)"]]

noaa_tmp = noaa_tmp.interpolate().dropna()
athens_tmp =athens_tmp.interpolate().dropna()

In [191]:
dataset = pd.merge(noaa_tmp,athens_tmp,on="DATE",how="left")
dataset = dataset.drop("mean_Temp (°C)_y",axis=1)
dataset.rename(columns={"mean_Temp (°C)_x":"MEAN_TEMPER"},inplace=True)

Index(['DATE', 'MEAN_TEMPER'], dtype='object')

In [192]:
dataset

             DATE  MEAN_TEMPER
0      1957-07-01         22.4
1      1957-07-02         26.1
2      1957-07-03         25.4
3      1957-07-04         26.5
4      1957-07-05         28.6
...           ...          ...
22334  2020-12-27         16.6
22335  2020-12-28         14.8
22336  2020-12-29         16.3
22337  2020-12-30         16.4
22338  2020-12-31         15.4

[22339 rows x 2 columns]